Revit 2027 API
AnalysisDisplayColoredSurfaceSettings.IsEqual Method
 Compares two colored surface settings objects.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	AnalysisDisplayColoredSurfaceSettings other
)
Public Function IsEqual (
	other As AnalysisDisplayColoredSurfaceSettings
) As Boolean
public:
bool IsEqual(
	AnalysisDisplayColoredSurfaceSettings^ other
)
member IsEqual :
        other : AnalysisDisplayColoredSurfaceSettings -> bool
Parameters
other AnalysisDisplayColoredSurfaceSettings
 Colored surface settings object to compare with.
Return Value
Boolean
 True if objects are equal, false otherwise.
See Also
Reference
AnalysisDisplayColoredSurfaceSettings Class
Autodesk.Revit.DB.Analysis Namespace